load-tests/baseline.yml
# Baseline load test configuration for performance comparison
config:
  target: 'https://traditional.ecommerce.localhost'
  # Accept self-signed certificates for load testing
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    - duration: 120
      arrivalRate: 100
      name: "Peak load"
  
  # Disable rate limiting for load testing
  environments:
    test:
      target: 'https://traditional.ecommerce.localhost'
      tls:
        rejectUnauthorized: false
      variables:
        rate_limiting: false

scenarios:
  - name: "Product browsing"
    weight: 70
    flow:
      - get:
          url: "/api/products"
          capture:
            - json: "$[0].id"
              as: "productId"
      - get:
          url: "/api/products/{{ productId }}"
      - think: 2

  - name: "Guest checkout simulation"
    weight: 30
    flow:
      - post:
          url: "/api/orders/guest"
          json:
            items:
              - product_id: "{{ $randomInt(1, 100) }}"
                quantity: "{{ $randomInt(1, 3) }}"
            guest_email: "test{{ $randomInt(1, 10000) }}@example.com"
            guest_name: "Test User {{ $randomInt(1, 1000) }}"
      - think: 5